# Создайте переменные разных типов данных:
#   - Создайте переменную name и присвойте ей значение вашего имени (строка).
#   - Выведите значение переменной name на экран.
#   - Создайте переменную age и присвойте ей значение вашего возраста (целое число).
#   - Выведите значение переменной age на экран.
#   - Перезапишите в age текущее значение переменной age + новое.

name = 'name: Vitalya'
print(name)
age = 35
print('age:', age)
New_ade = age + 1
print('New_ade:', New_ade)
print('Is Student: True')